Practical 4 DHCP


en
config t

int f0/0
 ip address 192.168.1.1 255.255.255.0
 no shut
exit

int f1/0
 ip address 192.168.2.1 255.255.255.0
 no shut
exit

ip dhcp pool Net1
 network 192.168.1.0 255.255.255.0
 default-router 192.168.1.1
exit

ip dhcp pool Net2
 network 192.168.2.0 255.255.255.0
 default-router 192.168.2.1
exit

exit
wr




Hereâ€™s the **updated version** with **router and PC configuration tables** added.  

---



Practical 5a: Simple OSPF Configuration**  

### **ðŸ”¹ Step 1: Add Devices**  
1. Add **3 PT Routers**.  
2. Add **1 PT Switch per Router**.  
3. Add **3 PCs per Switch**.  

### **ðŸ”¹ Step 2: Connect Devices**  
- **Router to Router** â†’ Use **Serial Cable** (**DCE to DTE**).  
- **Router to Switch** â†’ Use **FastEthernet Cable**.  
- **Switch to PCs** â†’ Use **FastEthernet Cable**.  

---

### **ðŸ”¹ Step 3: Assign IP Addresses**  

#### **Router Configuration Table**  

| **Router**  | **Interface**  | **IP Address**    | **Subnet Mask**     | **Connected To** |
|-------------|--------------|------------------|-----------------|----------------|
| **Router 1** | Fa0/0        | 192.168.1.1      | 255.255.255.0   | Switch 1       |
|             | Se2/0        | 10.0.0.1         | 255.255.255.252 | Router 2 (Se2/0) |
| **Router 2** | Fa0/0        | 192.168.2.1      | 255.255.255.0   | Switch 2       |
|             | Se2/0        | 10.0.0.2         | 255.255.255.252 | Router 1 (Se2/0) |
|             | Se3/0        | 10.0.1.1         | 255.255.255.252 | Router 3 (Se3/0) |
| **Router 3** | Fa0/0        | 192.168.3.1      | 255.255.255.0   | Switch 3       |
|             | Se3/0        | 10.0.1.2         | 255.255.255.252 | Router 2 (Se3/0) |

---

#### **PC Configuration Table**  

| **PC**  | **IP Address**    | **Subnet Mask**   | **Default Gateway** |
|---------|------------------|-----------------|----------------|
| **PC0** | 192.168.1.2      | 255.255.255.0   | 192.168.1.1   |
| **PC1** | 192.168.1.3      | 255.255.255.0   | 192.168.1.1   |
| **PC2** | 192.168.1.4      | 255.255.255.0   | 192.168.1.1   |
| **PC3** | 192.168.2.2      | 255.255.255.0   | 192.168.2.1   |
| **PC4** | 192.168.2.3      | 255.255.255.0   | 192.168.2.1   |
| **PC5** | 192.168.2.4      | 255.255.255.0   | 192.168.2.1   |
| **PC6** | 192.168.3.2      | 255.255.255.0   | 192.168.3.1   |
| **PC7** | 192.168.3.3      | 255.255.255.0   | 192.168.3.1   |
| **PC8** | 192.168.3.4      | 255.255.255.0   | 192.168.3.1   |

---

### **ðŸ”¹ Step 4: Configure OSPF (On Each Router)**  

#### **Router 1**  
```plaintext
Router(config)# router ospf 1
Router(config-router)# network 192.168.1.0 0.0.0.255 area 0
Router(config-router)# network 10.0.0.0 0.0.0.3 area 0
Router(config-router)# exit
```

#### **Router 2**  
```plaintext
Router(config)# router ospf 1
Router(config-router)# network 192.168.2.0 0.0.0.255 area 0
Router(config-router)# network 10.0.0.0 0.0.0.3 area 0
Router(config-router)# network 10.0.1.0 0.0.0.3 area 0
Router(config-router)# exit
```

#### **Router 3**  
```plaintext
Router(config)# router ospf 1
Router(config-router)# network 192.168.3.0 0.0.0.255 area 0
Router(config-router)# network 10.0.1.0 0.0.0.3 area 0
Router(config-router)# exit
```

---

### **ðŸ”¹ Step 5: Save Configuration**  
```plaintext
Router# write
```

---

### **ðŸ”¹ Step 6: Verify OSPF**  
Check OSPF neighbors:  
```plaintext
Router# show ip ospf neighbor
```
Check routing table:  
```plaintext
Router# show ip route
```
Test connectivity (Example: **PC0 to PC8**):  
```plaintext
PC> ping 192.168.3.2
```

---

Thatâ€™s it! ðŸŽ‰ You now have a **Single Area OSPF** network running in **Packet Tracer**. ðŸš€ Let me know if you need any modifications!







### **Practical: Multi-Area OSPF Configuration in Packet Tracer**  
Follow these steps to configure **Multi-Area OSPF** on the given network.

---

## **ðŸ›  Step 1: Adding Devices**  
Ensure the following devices are placed in Packet Tracer:  
- **4 Routers** (Router0, Router1, Router2, Router3)  
- **3 Switches** (Switch0, Switch1, Switch3)  
- **8 PCs** (PC0 - PC7)  

---

## **ðŸ”— Step 2: Connecting Devices**  
Use the following connections:  

ðŸ”¹ **PCs to Switches**:  
- **PC0 â†’ Switch0 (Fa0)**  
- **PC1 â†’ Switch0 (Fa0)**  
- **PC4 â†’ Switch1 (Fa0)**  
- **PC5 â†’ Switch1 (Fa0)**  
- **PC6 â†’ Switch3 (Fa0)**  
- **PC7 â†’ Switch3 (Fa0)**  

ðŸ”¹ **Switches to Routers**:  
- **Switch0 â†’ Router0 (Fa0/1)**  
- **Switch1 â†’ Router2 (Fa0/1)**  
- **Switch3 â†’ Router3 (Fa0/1)**  

ðŸ”¹ **Router Connections (Serial Links - WAN)**  
| **Router** | **Interface** | **IP Address** | **Connected to Router** | **Connected Interface** | **IP Address** |  
|------------|--------------|---------------|-----------------|-----------------|--------------|  
| Router0 | Se2/0 | 10.0.0.1 | Router1 | Se2/0 | 10.0.0.2 |  
| Router0 | Se3/0 | 20.0.0.1 | Router3 | Se3/0 | 20.0.0.2 |  
| Router1 | Se3/0 | 30.0.0.1 | Router3 | Se2/0 | 30.0.0.2 |  
| Router2 | Se2/0 | 40.0.0.1 | Router1 | Se3/0 | 40.0.0.2 |  

---

## **âš™ Step 3: Router & PC Configuration Tables**  
### **Router Interface Configurations**  

#### **Router0**
| **Interface** | **IP Address** | **Subnet Mask** |  
|--------------|---------------|-----------------|  
| Fa0/0 | 192.168.1.1 | 255.255.255.0 |  
| Se2/0 | 10.0.0.1 | 255.0.0.0 |  
| Se3/0 | 20.0.0.1 | 255.0.0.0 |  

#### **Router1**
| **Interface** | **IP Address** | **Subnet Mask** |  
|--------------|---------------|-----------------|  
| Fa1/1 | 192.168.2.1 | 255.255.255.0 |  
| Se2/0 | 10.0.0.2 | 255.0.0.0 |  
| Se3/0 | 30.0.0.1 | 255.0.0.0 |  

#### **Router2**
| **Interface** | **IP Address** | **Subnet Mask** |  
|--------------|---------------|-----------------|  
| Fa0/0 | 192.168.3.1 | 255.255.255.0 |  
| Se2/0 | 40.0.0.1 | 255.0.0.0 |  

#### **Router3**
| **Interface** | **IP Address** | **Subnet Mask** |  
|--------------|---------------|-----------------|  
| Fa0/0 | 192.168.4.1 | 255.255.255.0 |  
| Se2/0 | 30.0.0.2 | 255.0.0.0 |  
| Se3/0 | 20.0.0.2 | 255.0.0.0 |  

---

## **ðŸ–¥ Step 4: OSPF Configuration Commands**  
### **Configuring OSPF on Each Router**  

#### **Router0**
```bash
Router0(config)# router ospf 1
Router0(config-router)# network 192.168.1.0 0.0.0.255 area 0
Router0(config-router)# network 10.0.0.0 0.255.255.255 area 0
Router0(config-router)# network 20.0.0.0 0.255.255.255 area 1
Router0(config-router)# exit
```

#### **Router1**
```bash
Router1(config)# router ospf 1
Router1(config-router)# network 192.168.2.0 0.0.0.255 area 1
Router1(config-router)# network 10.0.0.0 0.255.255.255 area 0
Router1(config-router)# network 30.0.0.0 0.255.255.255 area 1
Router1(config-router)# exit
```

#### **Router2**
```bash
Router2(config)# router ospf 1
Router2(config-router)# network 192.168.3.0 0.0.0.255 area 2
Router2(config-router)# network 40.0.0.0 0.255.255.255 area 2
Router2(config-router)# exit
```

#### **Router3**
```bash
Router3(config)# router ospf 1
Router3(config-router)# network 192.168.4.0 0.0.0.255 area 2
Router3(config-router)# network 30.0.0.0 0.255.255.255 area 1
Router3(config-router)# network 20.0.0.0 0.255.255.255 area 1
Router3(config-router)# exit
```

---

## **ðŸ’¾ Step 5: Saving Configuration**  
After configuring each router, save the configurations using:  
```bash
Router# write memory
```

---

## **ðŸ“Œ Step 6: Verification Commands**  

### **1ï¸âƒ£ Check OSPF Neighbor Table**  
```bash
Router# show ip ospf neighbor
```

### **2ï¸âƒ£ Check OSPF Routing Table**  
```bash
Router# show ip route ospf
```

### **3ï¸âƒ£ Check OSPF Process Details**  
```bash
Router# show ip ospf
```

### **4ï¸âƒ£ Verify Connectivity (Ping Between PCs)**  
Example: From **PC0 to PC6**
```bash
PC> ping 192.168.4.2
```

---

### âœ… **Final Checks:**
âœ” All PCs should be able to communicate across different areas.  
âœ” OSPF neighbor relationships should be established.  
âœ” The routing table should show OSPF routes.  

---

ðŸš€ **Multi-Area OSPF is now successfully configured!** Let me know if you need any modifications. ðŸ”¥
