Practical 4 DHCP


en
config t

int f0/0
 ip address 192.168.1.1 255.255.255.0
 no shut
exit

int f1/0
 ip address 192.168.2.1 255.255.255.0
 no shut
exit

ip dhcp pool Net1
 network 192.168.1.0 255.255.255.0
 default-router 192.168.1.1
exit

ip dhcp pool Net2
 network 192.168.2.0 255.255.255.0
 default-router 192.168.2.1
exit

exit
wr




Hereâ€™s the **updated version** with **router and PC configuration tables** added.  

---



Practical 5a: Simple OSPF Configuration**  

### **ðŸ”¹ Step 1: Add Devices**  
1. Add **3 PT Routers**.  
2. Add **1 PT Switch per Router**.  
3. Add **3 PCs per Switch**.  

### **ðŸ”¹ Step 2: Connect Devices**  
- **Router to Router** â†’ Use **Serial Cable** (**DCE to DTE**).  
- **Router to Switch** â†’ Use **FastEthernet Cable**.  
- **Switch to PCs** â†’ Use **FastEthernet Cable**.  

---

### **ðŸ”¹ Step 3: Assign IP Addresses**  

#### **Router Configuration Table**  

| **Router**  | **Interface**  | **IP Address**    | **Subnet Mask**     | **Connected To** |
|-------------|--------------|------------------|-----------------|----------------|
| **Router 1** | Fa0/0        | 192.168.1.1      | 255.255.255.0   | Switch 1       |
|             | Se2/0        | 10.0.0.1         | 255.255.255.252 | Router 2 (Se2/0) |
| **Router 2** | Fa0/0        | 192.168.2.1      | 255.255.255.0   | Switch 2       |
|             | Se2/0        | 10.0.0.2         | 255.255.255.252 | Router 1 (Se2/0) |
|             | Se3/0        | 10.0.1.1         | 255.255.255.252 | Router 3 (Se3/0) |
| **Router 3** | Fa0/0        | 192.168.3.1      | 255.255.255.0   | Switch 3       |
|             | Se3/0        | 10.0.1.2         | 255.255.255.252 | Router 2 (Se3/0) |

---

#### **PC Configuration Table**  

| **PC**  | **IP Address**    | **Subnet Mask**   | **Default Gateway** |
|---------|------------------|-----------------|----------------|
| **PC0** | 192.168.1.2      | 255.255.255.0   | 192.168.1.1   |
| **PC1** | 192.168.1.3      | 255.255.255.0   | 192.168.1.1   |
| **PC2** | 192.168.1.4      | 255.255.255.0   | 192.168.1.1   |
| **PC3** | 192.168.2.2      | 255.255.255.0   | 192.168.2.1   |
| **PC4** | 192.168.2.3      | 255.255.255.0   | 192.168.2.1   |
| **PC5** | 192.168.2.4      | 255.255.255.0   | 192.168.2.1   |
| **PC6** | 192.168.3.2      | 255.255.255.0   | 192.168.3.1   |
| **PC7** | 192.168.3.3      | 255.255.255.0   | 192.168.3.1   |
| **PC8** | 192.168.3.4      | 255.255.255.0   | 192.168.3.1   |

---

### **ðŸ”¹ Step 4: Configure OSPF (On Each Router)**  

#### **Router 1**  
```plaintext
Router(config)# router ospf 1
Router(config-router)# network 192.168.1.0 0.0.0.255 area 0
Router(config-router)# network 10.0.0.0 0.0.0.3 area 0
Router(config-router)# exit
```

#### **Router 2**  
```plaintext
Router(config)# router ospf 1
Router(config-router)# network 192.168.2.0 0.0.0.255 area 0
Router(config-router)# network 10.0.0.0 0.0.0.3 area 0
Router(config-router)# network 10.0.1.0 0.0.0.3 area 0
Router(config-router)# exit
```

#### **Router 3**  
```plaintext
Router(config)# router ospf 1
Router(config-router)# network 192.168.3.0 0.0.0.255 area 0
Router(config-router)# network 10.0.1.0 0.0.0.3 area 0
Router(config-router)# exit
```

---

### **ðŸ”¹ Step 5: Save Configuration**  
```plaintext
Router# write
```

---

### **ðŸ”¹ Step 6: Verify OSPF**  
Check OSPF neighbors:  
```plaintext
Router# show ip ospf neighbor
```
Check routing table:  
```plaintext
Router# show ip route
```
Test connectivity (Example: **PC0 to PC8**):  
```plaintext
PC> ping 192.168.3.2
```

---

Thatâ€™s it! ðŸŽ‰ You now have a **Single Area OSPF** network running in **Packet Tracer**. ðŸš€ Let me know if you need any modifications!
